// 31.Вывести на экран кубы чисел от 1 до N

int n=7;
for (int i=1; i<=7;i++){
    System.Console.WriteLine($"{i} {i*i*i}");
}

